<h1>DataFrames</h1>

<h2>It is the collection of Series</h2>

<h3>Creating a dataframe</h3>

<h3>We can create a DataFrame through list and dictionary</h3>

In [3]:
import numpy as np 
import pandas as pd

In [4]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [8]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
df2

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [9]:
columns = ["Name", "Age", "City", "Salary"]
df2 = pd.DataFrame(data_list,columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

<h3>Selection and Indexing of Columns</h3>

In [10]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [11]:
df2["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [12]:
df2["City"]

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [14]:
df2[["Name", "Age", "City"]]

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   42    London

<h3>Creating a new Column</h3>

In [27]:
df2["Designation"] = ["Doctor", "Engineer", "Doctor", "Teacher"]

In [28]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000     Teacher

<h3>Removing a column</h3>

In [29]:
df2.drop('Designation', axis=1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [30]:
# but it will not remove from main ddata
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000    Engineer
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000     Teacher

<h4>Use (inplace=True) so that the deleted column will also remove from main data</h4>

In [31]:
df2.drop('Designation', axis=1, inplace = True)

In [32]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [34]:
df2.drop(["City", "Salary"], axis=1)

    Name  Age
0   John   28
1   Anna   34
2  Peter   29
3  Linda   42

<h4>Remove rows</h4>

In [36]:
df2.drop([0],axis=0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

<h2>Selecting Rows
</h2>

In [42]:
df2.loc[[0]]

   Name  Age      City  Salary
0  John   28  New York   65000

df2.loc[[0,1]]

<h2>Selecting Subsets of Rows and Columns</h2>

In [43]:
df.loc[[0,1]][["City", "Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

In [44]:
df.loc[[2,3]][["Name","Age"]]

    Name  Age
2  Peter   29
3  Linda   42

In [45]:
df.iloc[2]

Name       Peter
Age           29
City      Berlin
Salary     62000
Name: 2, dtype: object

<h2>Conditonal Selection</h2>

In [46]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [47]:
# select people whose age is above 30

df2[df2["Age"] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [53]:
# Select people who belogs to Paris and their age is above 30.abs

df2[(df2["Age"]> 30) & (df2["City"]== "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000